Repository: pingfangx/pythonx
Catalog: ToolsX/android_studio_translator/translation_inspection/data/AndroidBundle.tmx
Source language: en_us
Languages: zh_cn

source: Unexpected error while obtaining screenshot: {0}
zh_cn: 获取截图时出现意外错误：{0}

source: Unexpected error while saving screenshot: {0}
zh_cn: 保存屏幕截图时出现意外错误：{0}

source: Uninstalling will remove the application data!
zh_cn: 卸载会删除应用程序数据！

source: Unknown Android XML attribute
zh_cn: 未知的 Android XML 属性

source: Unknown attribute {0}
zh_cn: 未知属性 {0}

source: Unnecessary Divider Copy
zh_cn: 不必要的分隔符复制

source: Unprotected SMS BroadcastReceiver
zh_cn: 无保护的SMS BroadcastReceiver

source: Unreachable state in a <selector>
zh_cn: <selector>中的无法访问状态

source: Unsafe Protected BroadcastReceiver
zh_cn: 不安全受保护的BroadcastReceiver

source: Unsupported Chrome OS Hardware Feature
zh_cn: 不支持的Chrome操作系统硬件功能

source: Unsupported TV Hardware Feature
zh_cn: 不支持的电视硬件功能

source: Unsupported image (bits per pixel = {0}) received from device
zh_cn: 从设备接收的不支持的图像（每像素的位数= {0}）

source: Unused id
zh_cn: 未使用的id

source: Unused quantity translations
zh_cn: 未使用的数量翻译

source: Unused resources
zh_cn: 未使用的资源

source: Update 'appengine' plugin version
zh_cn: 更新' appengine '插件版本

source: Update AndroidManifest.xml
zh_cn: 更新AndroidManifest.xml

source: Update Layout Files
zh_cn: 更新布局文件

source: Update Property Files
zh_cn: 更新属性文件

source: Updating Image
zh_cn: 更新图像

source: Uploading Android SQLite Databases
zh_cn: 上传Android SQLite数据库

source: Usage of Android Wear BINDLISTENER is deprecated
zh_cn: Android Wear BINDLISTENER的使用已弃用

source: Usage of showAsAction=always
zh_cn: showAsAction=always的使用

source: Use Mipmap Launcher Icons
zh_cn: 使用Mipmap启动器图标

source: Use Style Where Possible
zh_cn: 尽可能使用Style

source: Use an existing key
zh_cn: 使用现有密钥

source: Use apply() on SharedPreferences
zh_cn: 在SharedPreferences上使用apply()

source: Use custom resource directory
zh_cn: 使用自定义资源目录

source: Use existing keystore
zh_cn: 使用现有的密钥库

source: Use of bundled version of Google Play services
zh_cn: 使用捆绑版本的Google Play服务

source: Use resource directory specified at "Structure" section
zh_cn: 使用在“结构”部分指定的资源目录

source: Useless leaf layout
zh_cn: 无用的叶布局

source: Useless parent layout
zh_cn: 无用的父布局

source: Using 'px' dimension
zh_cn: 使用' px '尺寸

source: Using .gif format for bitmaps is discouraged
zh_cn: 使用.gif格式进行位图是不鼓励的

source: Using 3-letter Codes
zh_cn: 使用3个字母的代码

source: Using FloatMath instead of Math
zh_cn: 使用FloatMath而不是Math

source: Using HTTP instead of HTTPS
zh_cn: 使用HTTP而不是HTTPS

source: Using RTL attributes without enabling RTL support
zh_cn: 使用RTL属性而未启用RTL支持

source: Using STRING instead of TEXT
zh_cn: 使用STRING而不是TEXT

source: Using VectorDrawableCompat
zh_cn: 使用VectorDrawableCompat

source: Using Wrong AppCompat Method
zh_cn: 使用错误的AppCompat方法

source: Using a fixed seed with SecureRandom
zh_cn: 使用固定种子与SecureRandom

source: Using deprecated resources
zh_cn: 使用不推荐的资源

source: Using dp instead of sp for text sizes
zh_cn: 文本大小使用dp而不是sp

source: Using inlined constants on older versions
zh_cn: 在旧版本上使用内联常量

source: Using left/right instead of start/end attributes
zh_cn: 使用 left/right 而不是 start/end 属性

source: Using mm or in dimensions
zh_cn: 使用mm或尺寸

source: Using mock location provider in production
zh_cn: 在生产中使用模拟位置提供程序

source: Using obsolete ProGuard configuration
zh_cn: 使用过时的ProGuard配置

source: Using private resources
zh_cn: 使用私有资源

source: Using setJavaScriptEnabled
zh_cn: 使用setJavaScriptEnabled

source: Using system app permission
zh_cn: 使用系统应用程序权限

source: Using wrong draw/layout method
zh_cn: 使用错误的draw/layout方法

source: Valid Full Backup Content File
zh_cn: 有效的完整备份内容文件

source: Valid Network Security Config File
zh_cn: 有效的网络安全配置文件

source: Validate <pin-set> expiration attribute
zh_cn: 验证<pin-set>到期属性

source: Validating
zh_cn: 验证

source: Validity (years)
zh_cn: 有效期（年）

source: Value overridden by Gradle build script
zh_cn: 由Gradle构建脚本覆盖的值

source: Vector Image Generation
zh_cn: 矢量图像生成

source: Verbose
zh_cn: 详细

source: VersionCode too high
zh_cn: VersionCode太高

source: View Android bitmap contents
zh_cn: 查看Android位图内容

source: View Bitmap
zh_cn: 查看位图

source: View Holder Candidates
zh_cn: View Holder候选人

source: Warning
zh_cn: 警告

source: Warning: debug info can be unavailable.
zh_cn: 警告：调试信息可能不可用。

source: We have now enabled Instant Run and extra logging to diagnose issues.<br>
zh_cn: 我们现在启用了即时运行和额外的日志记录来诊断问题

source: WebViews in wrapcontent parents
zh_cn: 在wrapcontent parents中的WebViews

source: Whitespace in NFC tech lists
zh_cn: NFC技术列表中的空白

source: WifiManager Leak
zh_cn: WifiManager泄漏

source: WifiManager Potential Leak
zh_cn: WifiManager潜在泄漏

source: Wipe user data
zh_cn: 擦除用户数据

source: Wrong case for view tag
zh_cn: view标签的错误情况

source: Wrong constant or resource type
zh_cn: 常量或资源类型错误

source: Wrong launcher icon format
zh_cn: 启动图标格式错误

source: Wrong locale name
zh_cn: 地区名称错误

source: Wrong system service casts
zh_cn: 错误的系统服务转换

source: You have to enable ADB integration to launch debugging.
zh_cn: 您必须启用 ADB 集成才能启动调试。

source: You need to create at least one JDK of versions 1.5, 1.6 or 1.7
zh_cn: 您需要创建至少一个版本1.5，1.6或1.7的JDK

source: Your Android SDK path is invalid.
zh_cn: 您的 Android SDK 路径无效。

source: Zoom In
zh_cn: 放大

source: Zoom Out
zh_cn: 缩小

source: Zoom to Fit
zh_cn: 缩放到适合

source: Zoom to actual size
zh_cn: 缩放到实际大小

source: [none]
zh_cn: [无]

source: [{0}] Android SDK is not specified or cannot be parsed
zh_cn: [{0}] Android SDK 未指定或无法解析

source: [{0}] AndroidManifest.xml file not found.
zh_cn: [{0}] AndroidManifest.xml 文件未找到。

source: addJavascriptInterface Called
zh_cn: addJavascriptInterface被调用

source: after reproducing the issue, click <b> Help | Report Instant Run Issue... </b> to send us the issue report.</li>
zh_cn: 当重现问题后，点击 <b> 帮助 | 报告即时运行问题... </b> 来向我们发送问题报告。</li>

source: app was restarted since it uses multiple processes
zh_cn: 应用程序重新启动，因为它使用多个进程

source: application does not have the 'debuggable' attribute enabled in its manifest.
zh_cn: 应用程序在其清单中没有启用“debuggable”属性。

source: application updates, Google Play serves patches that are typically much smaller.
zh_cn: 应用更新，Google Play服务补丁通常要小得多。

source: can also <a href="configure">configure</a> Instant Run to restart activities automatically
zh_cn: 也可以 <a href="configure">配置</a> 即时运行来自动重启activity

source: can customize these options below.
zh_cn: 可以自定义以下这些选项。

source: content root ''{0}'' of module ''{1}''
zh_cn: 模块“{1}”的内容根“{0}”

source: creating an issue at
zh_cn: 创造一个问题于

source: default, it records at the device's native resolution or at 720p at a 4 Mbps bitrate.<br>
zh_cn: 默认情况下，它以设备的原始分辨率或以4Mbps的比特率记录720p

source: devices with API level below 21, a full build is required if the app is not running
zh_cn: API级别低于21的设备，如果应用没有运行，则需要完整版本

source: enable Instant Run, deploy to a single target
zh_cn: 启用即时运行，部署到单个目标

source: file a bug at b.android.com including this message and your idea.log (Help | Show Log in ..)
zh_cn: 在b.android.com上提供一个错误，包括此消息和您的idea.log(Help | Show Log in ..)

source: help us troubleshoot and fix Instant Run issues by doing the following:<br>
zh_cn: 通过执行以下操作来帮助我们排除故障并修复即时运行问题：<br>

source: href="learnmore">Learn more</a> about how to run your app under a work profile
zh_cn: href="learnmore">了解更多</a> 关于如何在工作资料下运行应用程序

source: href="once">Only once</a><br><a href="always">Always for these modules</a><br><a href="never">Never for these modules</a>
zh_cn: href="once">仅一次</a><br><a href="always">总是为这些模块</a><br><a href="never">从不为这些模块</a>

source: href="updategradle">Update</a>
zh_cn: href="updategradle">更新</a>

source: information (e.g. project paths on disk).<br><br>
zh_cn: 信息 (比如项目在磁盘上的路径).<br><br>

source: installation on the device does not match the local build on disk
zh_cn: 设备上的安装与磁盘上的本地构建不匹配

source: installation size may be higher than the raw size depending on various other factors
zh_cn: 安装尺寸可能比原始尺寸高，这取决于其他因素。

source: is possible that this issue is resolved by uninstalling an existing version of the apk if it is present, and then re-installing.
zh_cn: 可能通过卸载现有版本的apk（如果存在），然后重新安装来解决此问题。

source: library dependency ''{0}''->''{1}''
zh_cn: 库依赖关系' ' {0} ' ' -> ' ' {1} ' '

source: load used to dynamically load code
zh_cn: load用于动态加载代码

source: logs will only be viewable by Google, and will be used for the sole purpose of troubleshooting<br>
zh_cn: 日志只能由Google查看，并且仅用于排除故障的目的<br>

source: may be able to recover from this issue by pressing 'Run' or 'Debug' again.
zh_cn: 可以通过再次按“运行”或“调试”来恢复此问题。

source: may need to <a href="restart">restart</a>{0} the current activity to see the changes.
zh_cn: 可能需要 <a href="restart">重启</a>{0} 当前activity以查看更改。

source: module ''{0}''
zh_cn: 模块 ''{0}''

source: module dependency ''{0}''->''{1}''
zh_cn: 模块依赖 ''{0}''->''{1}''

source: onClick handler is missing in the related activity
zh_cn: 相关Activity中缺少onClick处理程序

source: openFileOutput() or similar call passing MODEWORLDREADABLE
zh_cn: openFileOutput（）或类似的调用传递MODEWORLDREADABLE

source: openFileOutput() or similar call passing MODEWORLDWRITEABLE
zh_cn: openFileOutput（）或类似的调用传递MODEWORLDWRITEABLE

source: order to proceed, you have to uninstall the existing application.
zh_cn: 为了继续，你必须卸载现有的应用程序。

source: project ''{0}''
zh_cn: 项目“{0}”

source: send us an error report.<br><br>
zh_cn: 给我们发送错误报告。<br> <br>

source: settings (e.g. using jack) are currently not compatible with Instant Run.
zh_cn: 设置 (比如使用 jack) 目前与 Instant Run 不兼容。

source: signatureOrSystem permissions declared
zh_cn: signatureOrSystem权限声明

source: specify a signing configuration for this variant ({1})
zh_cn: 指定此变量的签名配置（{1}）

source: the Instant Run issue</li>
zh_cn: 即时运行的问题</li>

source: the app under a work profile or another user account on the target device will result in a crash.<br>
zh_cn: 目标设备下的工作配置文件或其他用户帐户下的应用程序将导致崩溃。<br>

source: the current device with density "{2}" and ABIs "{3}"
zh_cn: 密度为“{2}”，ABI“{3}”的当前设备

source: the device already has a newer version of this application
zh_cn: 设备已经具有此应用程序的较新版本

source: the device already has an application with the same package but a different signature
zh_cn: 设备已经有一个包含相同包但不同签名的应用程序

source: the device possibly has stale dexed jars that don't match the current version (dexopt error)
zh_cn: 该设备可能具有不匹配当前版本（dexopt错误）的过时的dexed jar，

source: this is a Gradle-based project, then make sure the signing configuration is specified in the Gradle build script
zh_cn: 这是一个基于Gradle的项目，然后确保在Gradle构建脚本中指定了签名配置

source: time you hit an Instant Run issue, you can click on <b> Help | Report Instant Run Issue... </b><br>
zh_cn: 当你触发即时运行问题时，你可以点击 <b> 帮助 | 报告即时运行问题... </b><br>

source: uncheck 'Log extra info for Instant Run'</html>
zh_cn: 取消选中 'Log extra info for Instant Run'</html>

source: update your app's minSdkVersion
zh_cn: 更新你的应用的 minSdkVersion

source: use Instant Run with a multidex enabled build variant, deploy to a target with API level 21 or higher
zh_cn: 要用启用了multidex的构建变量使用Instant Run，部署到API级别21或更高版本的目标

source: use Instant Run, log in on your device as the primary user and remove any '--user <UserID>' flag in your Run Configuration
zh_cn: 使用即时运行，以主用户身份登录设备，并在运行配置中删除任何'--user <UserID>'标志

source: use Instant Run, open SDK Manager and install the missing platform
zh_cn: 使用即时运行，打开SDK管理器并安装缺少的平台

source: want to make Instant Run perfect, but we need more info about your project to investigate issues.<br>
zh_cn: 想要使Instant Run完美，但是我们需要更多关于您的项目的信息来调查问题。

source: with this issue report.
zh_cn: 与此问题报告。

source: you are using Gradle, make sure that your current variant is debuggable
zh_cn: 您正在使用 Gradle，确保您当前的变量是可调试的

source: you change your mind, you can disable extra logging for Instant Run by going to <br>
zh_cn: 您改变主意，你可禁用即时运行的额外日志记录在这里

source: you have manually set it in the manifest, then remove it and let the IDE automatically assign it.
zh_cn: 您已经在清单中手动设置它，然后将其删除，并让IDE自动分配。

source: you like to help Google troubleshoot and fix Instant Run issues?
zh_cn: 您是否希望协助Google排查问题并解决即时运行问题？

source: you want to uninstall the existing application?
zh_cn: 你想卸载现有的应用程序码？

source: {0} (No Application Theme Found)
zh_cn: {0}（找不到应用主题）

source: {0} (Requires minSdk >= {1})
zh_cn: {0} (需要 minSdk >= {1})

source: {0} is added
zh_cn: {0} 已添加

source: {0} is not an Activity subclass or alias
zh_cn: {0} 不是 Activity 子类或别名

source: {0} is not an identifier
zh_cn: {0} 不是标识符

source: {0} is removed
zh_cn: {0}已称除

source: {0} resource file
zh_cn: {0} 资源文件
